/* 
   Пересоздайте класс Employee таким  образом, чтобы  переменная salary была   недоступна
   вне класса, переменная surname  была доступна отовсюду, а переменная id  только внутри
   пакета. Также  создайте 3 public метода, которые будут показывать на  дисплее значения
   этих переменных. Создайте для данного класса 3 разных конструктора с public, default и 
   private access modifier-ами. В  конструкторах  присваивайте переменным класса значения 
   из параметров. Создайте новые классы в том и другом пакете. Попытайтесь В них  создать 
   объекты  класса  Employee  и  вывести  на экран  значения переменных данного объекта с 
   помощью метода println и методов самого класса.
 */

package homeTaskLesson7;


public class Employee {
    
}
